{
  "url": "https://natesnewsletter.substack.com/p/anthropic-just-put-claude-inside",
  "slug": "i-built-an-11-tab-financial-model-in-10-minutes-the-prompting-guide-that-makes-i",
  "title": "I built an 11-tab financial model in 10 minutes + the prompting guide that makes it repeatable",
  "subtitle": "Watch now | Just 5 months ago, AI was only just starting to crack Excel. Now, weeks of modeling work can happen in minutes.",
  "author": "Nate",
  "published": "Tue, 27 Jan 2026 14:03:23 GMT",
  "content_html": "<p>This morning I built an eleven-tab financial model in ten minutes. Sensitivity analysis, opportunity cost comparisons against S&amp;P 500 returns, risk quantification, market data by zip code, cash flow projections&#8212;the whole apparatus. Two weeks of work compressed into the time it takes to make coffee. Norway&#8217;s sovereign wealth fund reports saving 213,000 hours with the same tool. This is not incremental improvement. This is a phase change in what knowledge work means.</p><p>And here&#8217;s the part that should break your model of how AI competition works: the tool is Claude, it&#8217;s now embedded inside Microsoft Excel, it&#8217;s connected to financial data feeds that Microsoft doesn&#8217;t have built-in access to, and Microsoft is paying Anthropic thirty billion dollars for the privilege of hosting it on Azure.</p><p>On Friday (January 24, 2026), Anthropic opened Claude in Excel to anyone with a Pro subscription&#8212;twenty dollars a month. Before that, it was gated to expensive enterprise tiers. Now it&#8217;s not. What Anthropic has built is a template for how the next phase of AI competition actually works. The race to build better base models is approaching diminishing returns. The race to embed intelligence in workflows, backed by proprietary data partnerships, is just beginning. Anthropic understood this before almost anyone else, and Excel is their proof of concept.</p><p><strong>Here&#8217;s what&#8217;s inside:</strong></p><ul><li><p><strong>What Claude in Excel actually is.</strong> Not a formula assistant&#8212;a native sidebar with full structural awareness of your workbook, cell-level citations, and transparent change tracking.</p></li><li><p><strong>Where it&#8217;s transformative and where it&#8217;s not.</strong> The honest breakdown of what works, what requires human input, and what&#8217;s functional but not polished.</p></li><li><p><strong>The strategic shift nobody&#8217;s talking about.</strong> Why the model race is hitting diminishing returns, and why workflow integration backed by data partnerships is the new competition.</p></li><li><p><strong>The data moat strategy.</strong> How Anthropic assembled licensed partnerships with LSEG, Moody&#8217;s, S&amp;P Capital IQ, and others&#8212;and why Microsoft can&#8217;t easily replicate it.</p></li><li><p><strong>The coopetition paradox.</strong> Microsoft is simultaneously hosting Claude, competing against it, and collecting billions from Anthropic. What this tells us about where AI is heading.</p></li><li><p><strong>What I built.</strong> Three spreadsheets that demonstrate the transformation: a rent-vs-buy calculator, a FAANG-vs-AI equity analysis, and an AI trends data compilation.</p></li><li><p><strong>The prompts and best practices.</strong> How to actually use this thing, with the specific language that gets results.</p></li></ul><p>Let me show you what Anthropic actually built&#8212;and why it matters for how you work.</p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://natesnewsletter.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Subscribers get all posts like these!</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>\n      <p>\n          <a href=\"https://natesnewsletter.substack.com/p/anthropic-just-put-claude-inside\">\n              Read more\n          </a>\n      </p>\n   ",
  "content_text": "This morning I built an eleven-tab financial model in ten minutes. Sensitivity analysis, opportunity cost comparisons against S&P 500 returns, risk quantification, market data by zip code, cash flow projections—the whole apparatus. Two weeks of work compressed into the time it takes to make coffee. Norway’s sovereign wealth fund reports saving 213,000 hours with the same tool. This is not incremental improvement. This is a phase change in what knowledge work means.And here’s the part that should break your model of how AI competition works: the tool is Claude, it’s now embedded inside Microsoft Excel, it’s connected to financial data feeds that Microsoft doesn’t have built-in access to, and Microsoft is paying Anthropic thirty billion dollars for the privilege of hosting it on Azure.On Friday (January 24, 2026), Anthropic opened Claude in Excel to anyone with a Pro subscription—twenty dollars a month. Before that, it was gated to expensive enterprise tiers. Now it’s not. What Anthropic has built is a template for how the next phase of AI competition actually works. The race to build better base models is approaching diminishing returns. The race to embed intelligence in workflows, backed by proprietary data partnerships, is just beginning. Anthropic understood this before almost anyone else, and Excel is their proof of concept.Here’s what’s inside:What Claude in Excel actually is. Not a formula assistant—a native sidebar with full structural awareness of your workbook, cell-level citations, and transparent change tracking.Where it’s transformative and where it’s not. The honest breakdown of what works, what requires human input, and what’s functional but not polished.The strategic shift nobody’s talking about. Why the model race is hitting diminishing returns, and why workflow integration backed by data partnerships is the new competition.The data moat strategy. How Anthropic assembled licensed partnerships with LSEG, Moody’s, S&P Capital IQ, and others—and why Microsoft can’t easily replicate it.The coopetition paradox. Microsoft is simultaneously hosting Claude, competing against it, and collecting billions from Anthropic. What this tells us about where AI is heading.What I built. Three spreadsheets that demonstrate the transformation: a rent-vs-buy calculator, a FAANG-vs-AI equity analysis, and an AI trends data compilation.The prompts and best practices. How to actually use this thing, with the specific language that gets results.Let me show you what Anthropic actually built—and why it matters for how you work.Subscribers get all posts like these!\n      \n          \n              Read more\n          \n      \n   ",
  "harvested_at": "2026-01-28T22:49:08.219049"
}