{
  "url": "https://natesnewsletter.substack.com/p/6-practices-for-when-the-models-got",
  "slug": "the-identity-shift-that-unlocked-real-throughput-and-how-to-make-it-stick-plus-a",
  "title": "The identity shift that unlocked real throughput and how to make it stick (plus an in-depth builders guide for 2026)",
  "subtitle": "Watch now | What do you do when raw capability stops being the bottleneck? (Spoiler: it's not better prompting skills)",
  "author": "Nate",
  "published": "Fri, 23 Jan 2026 14:02:47 GMT",
  "content_html": "<p>We solved the wrong problem.</p><p>For two years, we optimized for capability. Better prompting. Smarter tool selection. More tokens. We treated AI fluency as a skill pack to acquire&#8212;learn the right incantations, and the machine would obey.</p><p>It worked. The capability ceiling lifted. An average engineer can now produce code at a rate that would have seemed impossible in 2023. Steve Yegge is running 10 to 20 parallel Claude Code instances through his Gas Town orchestrator, churning through implementation plans so fast that the bottleneck isn&#8217;t the agents&#8212;it&#8217;s keeping them fed with work.</p><p>And yet.</p><p>Cal Newport&#8217;s recent New Yorker piece landed with the force of a correction: &#8220;Why A.I. Didn&#8217;t Transform Our Lives in 2025.&#8221; The Year of the Agent dissolved into what Andrej Karpathy now calls &#8220;the Decade of the Agent&#8221;&#8212;a quiet admission that we don&#8217;t actually know how to build the digital employees we were promised. Sam Altman said agents would &#8220;materially change the output of companies&#8221; in 2025. Marc Benioff claimed a &#8220;digital labor revolution&#8221; worth trillions. OpenAI&#8217;s ChatGPT Agent spent nearly a quarter of an hour trying to select a value from a drop-down menu on a real estate website.</p><p>Gartner predicts over 40% of agentic AI projects will be canceled by the end of 2027&#8212;not because the models fail, but because of escalating costs, unclear business value, and inadequate risk controls. The agents don&#8217;t fail because they&#8217;re too dumb. They fail because&#8212;as Gary Marcus puts it&#8212;we&#8217;re building &#8220;clumsy tools on top of clumsy tools.&#8221;</p><p>Meanwhile, in the narrow domain of software development, something different happened. Coding agents did work. Claude Code and Codex became genuinely useful. Developers who figured out the workflow reported productivity gains that ranged from meaningful to transformative.</p><p>The question is: why the divergence? Why did coding agents succeed where general agents failed?</p><p>Newport points to one factor: the terminal is a constrained, text-based environment with immediate, unambiguous feedback. But there&#8217;s a deeper answer that matters more for what comes next.</p><p>Something doesn&#8217;t add up. The models got smarter. The tools got better. And yet the builders I talk to&#8212;the ones actually shipping with AI daily&#8212;describe a different constraint entirely.</p><p>&#8220;Raw ability to build is not my limitation anymore,&#8221; a friend told me recently. He&#8217;d just shipped an iOS app with a full backend in a few weeks, vibe-coded through Claude. &#8220;The constraint is how much I can concurrently think sensibly about.&#8221;</p><p>That&#8217;s the shift. The bottleneck moved from capability to cognitive architecture. And almost nobody has updated their operating system to account for it.</p><p><strong>Here&#8217;s what&#8217;s inside:</strong></p><ul><li><p><strong>The engineering manager identity shift.</strong> Why thinking of yourself as a fleet commander&#8212;not an engineer who uses AI&#8212;changes how you allocate attention.</p></li><li><p><strong>Killing the contribution badge.</strong> The legacy instinct costing you throughput, and why starting before you&#8217;re &#8220;ready&#8221; produces better output.</p></li><li><p><strong>Strategic deep-diving.</strong> How to move between altitudes&#8212;delegating implementation while maintaining embodied understanding.</p></li><li><p><strong>Temporal separation.</strong> Why building and reflecting require different brain chemistry, and how to create feedback loops that make you better, not just faster.</p></li><li><p><strong>Two kinds of architecture.</strong> The distinction between patterns you can delegate and taste you cannot.</p></li><li><p><strong>The experience problem.</strong> What gets lost when you can manifest a vision overnight, and how to preserve the discoveries that reveal what you actually want to build.</p></li></ul><p>The practices that follow aren&#8217;t prompting techniques. They&#8217;re cognitive architecture for a world where raw capability stopped being the constraint.</p><div class=\"subscription-widget-wrap-editor\" data-attrs=\"{&quot;url&quot;:&quot;https://natesnewsletter.substack.com/subscribe?&quot;,&quot;text&quot;:&quot;Subscribe&quot;,&quot;language&quot;:&quot;en&quot;}\" data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\">Subscribers get all posts like these!</p></div><form class=\"subscription-widget-subscribe\"><input type=\"email\" class=\"email-input\" name=\"email\" placeholder=\"Type your email&#8230;\" tabindex=\"-1\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>\n      <p>\n          <a href=\"https://natesnewsletter.substack.com/p/6-practices-for-when-the-models-got\">\n              Read more\n          </a>\n      </p>\n   ",
  "content_text": "We solved the wrong problem.For two years, we optimized for capability. Better prompting. Smarter tool selection. More tokens. We treated AI fluency as a skill pack to acquire—learn the right incantations, and the machine would obey.It worked. The capability ceiling lifted. An average engineer can now produce code at a rate that would have seemed impossible in 2023. Steve Yegge is running 10 to 20 parallel Claude Code instances through his Gas Town orchestrator, churning through implementation plans so fast that the bottleneck isn’t the agents—it’s keeping them fed with work.And yet.Cal Newport’s recent New Yorker piece landed with the force of a correction: “Why A.I. Didn’t Transform Our Lives in 2025.” The Year of the Agent dissolved into what Andrej Karpathy now calls “the Decade of the Agent”—a quiet admission that we don’t actually know how to build the digital employees we were promised. Sam Altman said agents would “materially change the output of companies” in 2025. Marc Benioff claimed a “digital labor revolution” worth trillions. OpenAI’s ChatGPT Agent spent nearly a quarter of an hour trying to select a value from a drop-down menu on a real estate website.Gartner predicts over 40% of agentic AI projects will be canceled by the end of 2027—not because the models fail, but because of escalating costs, unclear business value, and inadequate risk controls. The agents don’t fail because they’re too dumb. They fail because—as Gary Marcus puts it—we’re building “clumsy tools on top of clumsy tools.”Meanwhile, in the narrow domain of software development, something different happened. Coding agents did work. Claude Code and Codex became genuinely useful. Developers who figured out the workflow reported productivity gains that ranged from meaningful to transformative.The question is: why the divergence? Why did coding agents succeed where general agents failed?Newport points to one factor: the terminal is a constrained, text-based environment with immediate, unambiguous feedback. But there’s a deeper answer that matters more for what comes next.Something doesn’t add up. The models got smarter. The tools got better. And yet the builders I talk to—the ones actually shipping with AI daily—describe a different constraint entirely.“Raw ability to build is not my limitation anymore,” a friend told me recently. He’d just shipped an iOS app with a full backend in a few weeks, vibe-coded through Claude. “The constraint is how much I can concurrently think sensibly about.”That’s the shift. The bottleneck moved from capability to cognitive architecture. And almost nobody has updated their operating system to account for it.Here’s what’s inside:The engineering manager identity shift. Why thinking of yourself as a fleet commander—not an engineer who uses AI—changes how you allocate attention.Killing the contribution badge. The legacy instinct costing you throughput, and why starting before you’re “ready” produces better output.Strategic deep-diving. How to move between altitudes—delegating implementation while maintaining embodied understanding.Temporal separation. Why building and reflecting require different brain chemistry, and how to create feedback loops that make you better, not just faster.Two kinds of architecture. The distinction between patterns you can delegate and taste you cannot.The experience problem. What gets lost when you can manifest a vision overnight, and how to preserve the discoveries that reveal what you actually want to build.The practices that follow aren’t prompting techniques. They’re cognitive architecture for a world where raw capability stopped being the constraint.Subscribers get all posts like these!\n      \n          \n              Read more\n          \n      \n   ",
  "harvested_at": "2026-01-28T22:49:08.219585"
}