{
  "actionable": [
    {
      "insight": "Use “dumb” checklists for “smart” days On good brain days, I used to forget basic stuff like brushing my",
      "context": "extracted from content",
      "applicability": "personal"
    },
    {
      "insight": "use a daily checklist that includes everything — even the obvious stuff. Brush teeth? ✔️ Eat breakfast?",
      "context": "extracted from content",
      "applicability": "personal"
    },
    {
      "insight": "Try this: Make your own “morning survival checklist.” Laminate it. Use a whiteboard marker. Laugh at it.",
      "context": "extracted from content",
      "applicability": "personal"
    }
  ],
  "frameworks": [],
  "takeaways": [
    "Spoiler: none of them were helpful",
    "I used to think I was just lazy",
    "I forgot appointments, lost my wallet weekly, and had about 37 tabs open in my brain at all times",
    "I was just trying to organize my life using systems that were never made for a brain like mine",
    "No matter how many planners I bought or how many YouTube productivity gurus I binge-watched at 2AM, I still couldn’t get my life together"
  ],
  "resources": [
    {
      "type": "book",
      "name": "them. But putting my meds next to the kettle? That works. We ADHD brains are object permanence-challenged. If we don’t see it, it doesn’t exist. Try this: Move your most forgotten task into your line of sight. Put it in your walking path. Tape it to your laptop if you have to. 5. Pick your “launch pad” This one saved me from the daily panic of missing essentials. I now have a “launch pad” by the front door: keys, wallet, work bag, meds, umbrella. It’s all there, waiting like a faithful golden retriever. Try this: Create a launch pad. Use a basket, shelf, or even a shoebox. Put your everyday essentials there. Non-negotiable. 6. Name your bins like a weirdo I used to shove things in random boxes. Out of sight, out of mind…until I needed them. Now, I give bins funny, obvious names. One says “Cables &amp; Crap.” Another is “Stuff I Pretend I’ll Return.” It makes me smile —",
      "link": ""
    }
  ],
  "quotes": [],
  "para_tags": [],
  "topic_tags": [],
  "source_file": "/home/liam/clawd/content-intelligence/sources/rhys-morgan/archive/10-simple-organization-hacks-that.json",
  "source_title": "10 simple organization hacks that actually work for my ADHD brain",
  "source_url": "https://rhysmorgan.substack.com/p/10-simple-organization-hacks-that",
  "extracted_at": "2026-01-28T22:14:42.212706",
  "source_name": "rhys-morgan"
}