{
  "actionable": [
    {
      "insight": "do better” and “just be normal.” But guess what? Normal doesn’t exist. And ADHD doesn’t need fixing. It",
      "context": "extracted from content",
      "applicability": "personal"
    },
    {
      "insight": "make risky choices and then shame myself for days. Now? I know my gut works fast... sometimes faster than",
      "context": "extracted from content",
      "applicability": "personal"
    },
    {
      "insight": "start a business, say yes to scary things. I don’t shame it anymore. I train it. 🔁 Repetition became patte",
      "context": "extracted from content",
      "applicability": "personal"
    }
  ],
  "frameworks": [],
  "takeaways": [
    "WHEN it hits you that you’ve been gaslighting yourself for years It wasn’t in a therapy session or some self-help book with too many graphs",
    "That my ADHD was broken software I was born with",
    "And somewhere in that spiral of impulsive choices and dopamine-chasing, I decided it was my fault",
    "I lost my way more times than I could count",
    "But then something weird happened"
  ],
  "resources": [
    {
      "type": "book",
      "name": "with too many graphs. It was when I watched a friend (who also had ADHD) absolutely crush a creative project in 48 hours flat. No plan. No checklist. No structure. Just pure focus. Obsession. Flow. And I remember thinking... Wait a sec. Why does she get to be a genius with ADHD, and I get to be a failure? That’s when the switch flipped. Maybe ADHD isn’t the villain. Maybe it’s the script that’s broken... not the character. The “hating your ADHD” script goes like this: You get distracted → You beat yourself up You hyperfocus for 12 hours → You call yourself “crazy” You miss a deadline → You label yourself “lazy” You interrupt someone → You call yourself “rude” You get addicted to something (or someone) → You call yourself “damaged” And this whole time, you’re dragging around this emotional backpack full of shame, telling yourself you need to “do better” and “just be normal.” But guess what? Normal doesn’t exist. And ADHD doesn’t need fixing. It needs reframing. So I flipped the script... I stopped looking at my ADHD like a diagnosis... and started treating it like a language I was never taught to read. A neurodivergent dialect. With its own grammar. Tempo. Rhythm. Needs. Here’s what changed when I stopped hating it: 🧨 Impulsivity became courage I used to make risky choices and then shame myself for days. Now? I know my gut works fast... sometimes faster than my fear. That same impulsivity helped me leave toxic jobs, start a business, say yes to scary things. I don’t shame it anymore. I train it. 🔁 Repetition became pattern-recognition All those times I’d “make the same mistake again and again”? Now I see those loops as data. Addiction, for me, was just an attempt to self-regulate in a world that wasn’t built for my nervous system. It wasn’t a moral failing. It was a cry for balance. 🧃 Dopamine-chasing became flow-hacking I learned I’m not addicted to chaos. I’m addicted to novelty . So I stopped trying to force myself to work like neurotypicals... and I started building around my dopamine needs. Timers. Body doubling. Creative sprints. Micro-rewards. I made my own rulebook. 🚀 And that scattered energy? Became my superpower Some people focus on one thing for 10 years. I can master something in 2 weeks when I’m locked in. That’s not a deficit. That’s a f*cking gift. But only when I stopped trying to suppress it. Real talk: You can’t hate yourself into healing I tried.",
      "link": ""
    }
  ],
  "quotes": [],
  "para_tags": [],
  "topic_tags": [],
  "source_file": "/home/liam/clawd/content-intelligence/sources/rhys-morgan/archive/flipping-the-script-on-hating-your.json",
  "source_title": "🧠 Flipping the script on “hating your ADHD”",
  "source_url": "https://rhysmorgan.substack.com/p/flipping-the-script-on-hating-your",
  "extracted_at": "2026-01-28T22:14:42.213822",
  "source_name": "rhys-morgan"
}