{
  "actionable": [
    {
      "insight": "use there was zero dopamine in Ovid’s love poems or Cicero’s letters. The causes and consequences of the",
      "context": "extracted from content",
      "applicability": "personal"
    },
    {
      "insight": "make things easier — it just meant the stakes were higher. At work, I constantly misread social signs and",
      "context": "extracted from content",
      "applicability": "personal"
    }
  ],
  "frameworks": [],
  "takeaways": [
    "Meanwhile, in lessons, I was miles away, lost in daydreams because there was zero dopamine in Ovid’s love poems or Cicero’s letters",
    "Evening meals at home , I had two brothers",
    "Lunchtimes were the worst — the clatter of plates and trays in a packed school dinner hall felt like standing next to a jet engine",
    "The Undertones, Earth, Wind &amp; Fire’s Let’s Groove — I’d listen on repeat until the tape wore thin",
    "As a kid, I knew something was “off,” though I couldn’t put words to it"
  ],
  "resources": [
    {
      "type": "book",
      "name": "social signs and was hopeless at office politics. The same thing happened when I became an Anglican priest. I loved parts of the role, but apart from Sunday I lacked a daily structure and was often blind to unspoken rules just like previous jobs, that others seemed to navigate effortlessly. Alcohol became my shortcut to confidence. It dulled the exhaustion and smoothed over the gaps in my social game. But the cost was high. Eventually, my marriage fell apart. And so did I. The unexpected connection at an AA meeting Then, one day in an AA meeting, everything shifted. A woman began to share her story. In detail, her life looked nothing like mine. But as she described her struggles at work and the way she’d always felt different, it was like listening to my own thoughts being spoken aloud. In that moment, the penny dropped. A personal epiphany. That’s my story exactly — apart from getting pregnant, of course. I sat there thinking: Oh my God. This is it. This is me. My wife’s push and the official diagnosis Even then, I didn’t rush to act. It was my wife who gently pushed me: “Maybe you should get tested.” At 54 years old, I finally did. When the diagnosis came back — autistic, with ADHD — I felt a rush of emotions collide: relief that I finally had an explanation, sadness for the years I’d spent stumbling in the dark, and a quiet strength knowing I wasn’t imagining it. If I’m honest, I knew before the results came in. The moment I suspected, I went into hyperfocus mode, researching everything I could get my hands on. The “aha” moment: self-doubt turning into self-acceptance That was the moment it clicked.",
      "link": ""
    }
  ],
  "quotes": [],
  "para_tags": [],
  "topic_tags": [],
  "source_file": "/home/liam/clawd/content-intelligence/sources/rhys-morgan/archive/the-moment-it-clicked-my-late-diagnosis.json",
  "source_title": "The Moment It Clicked: My Late Diagnosis Story",
  "source_url": "https://rhysmorgan.substack.com/p/the-moment-it-clicked-my-late-diagnosis",
  "extracted_at": "2026-01-28T22:14:42.216664",
  "source_name": "rhys-morgan"
}