{
  "url": "https://rhysmorgan.substack.com/p/10-simple-organization-hacks-that",
  "slug": "10-simple-organization-hacks-that-actually-work-for-my-adhd-brain",
  "title": "10 simple organization hacks that actually work for my ADHD brain",
  "subtitle": "I used to think I was just lazy.",
  "author": "Rhys Morgan",
  "published": "Sat, 03 May 2025 09:25:31 GMT",
  "content_html": "<p>I used to think I was just lazy.</p><p>No matter how many planners I bought or how many YouTube productivity gurus I binge-watched at 2AM, I still couldn&#8217;t get my life together.</p><p>I forgot appointments, lost my wallet weekly, and had about 37 tabs open in my brain at all times. Spoiler: none of them were helpful.</p><p>Turns out, I wasn&#8217;t lazy. I was just trying to organize my life using systems that were never made for a brain like mine.</p><p>So I threw out the idea of being &#8220;organized&#8221; in the neurotypical sense and started building systems that <em>actually worked</em> for me &#8212; with my distractions, my hyperfocus, my tendency to drop socks mid-task and wander off like a cartoon character.</p><p>Here are 10 simple hacks that helped me feel less chaotic &#8212; and maybe they&#8217;ll help you too.</p><div><hr></div><h3><strong>1. Use &#8220;dumb&#8221; checklists for &#8220;smart&#8221; days</strong></h3><p>On good brain days, I used to forget basic stuff like brushing my teeth or feeding myself. So now I use a <em>daily checklist</em> that includes everything &#8212; even the obvious stuff.</p><ul><li><p>Brush teeth? &#10004;&#65039;<br><br></p></li><li><p>Eat breakfast? &#10004;&#65039;<br><br></p></li><li><p>Take meds? &#10004;&#65039;<br><br></p></li><li><p>Put on pants? Sadly, yes. &#10004;&#65039;<br><br></p></li></ul><p>It sounds silly, but it keeps me grounded. And crossing things off feels <em>amazing</em>.</p><p><strong>Try this:</strong> Make your own &#8220;morning survival checklist.&#8221; Laminate it. Use a whiteboard marker. Laugh at it. Love it.</p><div><hr></div><h3><strong>2. One basket per chaos zone</strong></h3><p>I gave up trying to stop clutter. Instead, I contain it.</p><p>Now every surface that used to collect junk has a designated basket. Keys, receipts, chargers, sunglasses &#8212; they all get thrown in.</p><p>At the end of the week, I empty the baskets (or at least pretend I will).</p><p><strong>Try this:</strong> Walk around your home and spot the 3 most chaotic &#8220;dump zones.&#8221; Add a basket, tray, or box. That&#8217;s it.</p><div><hr></div><h3><strong>3. Timers = your best non-judgmental friend</strong></h3><p>I don&#8217;t trust myself with time. 5 minutes becomes 2 hours. Or vice versa.</p><p>So I use timers like a toddler learning to brush their teeth. Ten minutes for tidying. Twenty for emails. A five-minute warning before I have to stop hyperfocusing on Reddit.</p><p><strong>Try this:</strong> Set a 10-minute timer today and clean one room. Just one. Stop when it buzzes. No guilt.</p><div><hr></div><h3><strong>4. Visual reminders over written ones</strong></h3><p>Sticky notes? I forget to read them.</p><p>But putting my meds next to the kettle? That works.</p><p>We ADHD brains are <em>object permanence-challenged.</em> If we don&#8217;t see it, it doesn&#8217;t exist.</p><p><strong>Try this:</strong> Move your most forgotten task into your line of sight. Put it in your walking path. Tape it to your laptop if you have to.</p><div><hr></div><h3><strong>5. Pick your &#8220;launch pad&#8221;</strong></h3><p>This one saved me from the daily panic of missing essentials.</p><p>I now have a &#8220;launch pad&#8221; by the front door: keys, wallet, work bag, meds, umbrella. It&#8217;s all there, waiting like a faithful golden retriever.</p><p><strong>Try this:</strong> Create a launch pad. Use a basket, shelf, or even a shoebox. Put your everyday essentials there. Non-negotiable.</p><div><hr></div><h3><strong>6. Name your bins like a weirdo</strong></h3><p>I used to shove things in random boxes. Out of sight, out of mind&#8230;until I needed them.</p><p>Now, I give bins funny, obvious names. One says &#8220;Cables &amp; Crap.&#8221; Another is &#8220;Stuff I Pretend I&#8217;ll Return.&#8221;</p><p>It makes me smile &#8212; and more likely to use them.</p><p><strong>Try this:</strong> Label <em>one</em> bin in your house today. Make it ridiculous. ADHD brains love humor.</p><div><hr></div><h3><strong>7. Use &#8220;body doubling&#8221; even if you&#8217;re alone</strong></h3><p>I hate doing dishes. But if someone&#8217;s in the room with me &#8212; even if they&#8217;re just scrolling TikTok &#8212; I can do them.</p><p>Body doubling (having someone nearby while you work) <em>works.</em> But when I&#8217;m solo, I fake it.</p><p>I play a podcast or video of someone else doing the task. Boom &#8212; instant &#8220;fake coworker.&#8221;</p><p><strong>Try this:</strong> Next time you feel stuck, search &#8220;clean with me&#8221; or &#8220;study with me&#8221; on YouTube. Let your new internet buddy help.</p><div><hr></div><h3><strong>8. Keep a &#8220;maybe later&#8221; box</strong></h3><p>Decision paralysis is real. Do I throw this out? Will I need it next week? Will I regret it?</p><p>Now, I chuck uncertain things into a &#8220;maybe later&#8221; box. Once a month, I revisit it.</p><p>No more agonizing. Just delay the decision.</p><p><strong>Try this:</strong> Start your own &#8220;maybe&#8221; box. Label it &#8220;emotional clutter jail.&#8221;</p><div><hr></div><h3><strong>9. Gamify the boring stuff</strong></h3><p>Filing paperwork feels like a punishment. But if I turn it into a 3-round game show, I&#8217;ll actually do it.</p><p>Round 1: Stack papers.<br> Round 2: Shred duplicates.<br> Round 3: File the survivors.</p><p>Add a reward &#8212; like tea or a nap. Brains like bribes.</p><p><strong>Try this:</strong> Turn one boring task today into a 3-step mini game. Bonus points for theme music.</p><div><hr></div><h3><strong>10. Don&#8217;t organize </strong><em><strong>everything</strong></em><strong>. Just what matters.</strong></h3><p>Here&#8217;s the hard truth: you don&#8217;t have to be organized.</p><p>You just need to make the <em>most important things</em> easier to access, use, and remember.</p><p>You&#8217;re not a failure for having messy drawers or forgetting laundry. You&#8217;re a human with a differently-wired brain. Pick your priorities.</p><p><strong>Try this:</strong> What&#8217;s <em>one thing</em> that, if it ran smoother, would make your day easier? Start there.</p><div><hr></div><h3><strong>Final takeaway</strong></h3><p>So those are the 10 simple organization hacks that actually worked for my ADHD brain.</p><p>Not all of them will work for you. And that&#8217;s okay.</p><p>Take the ones that <em>spark something.</em> Ignore the rest. You don&#8217;t need a full system &#8212; just a few anchors to keep you steady.</p><p>You&#8217;re not broken. You just need different tools.</p><div><hr></div><h3><strong>&#128172; Call to action (realistic + reassuring):</strong></h3><p>Want more no-BS tips for living with ADHD, addiction recovery, and starting fresh at any age? I write weekly to help folks like us build lives we don&#8217;t need to escape from.</p><p><strong>Subscribe below</strong> &#8212; even if you only open one email a month, it might be the one that helps you get unstuck.</p>",
  "content_text": "I used to think I was just lazy.No matter how many planners I bought or how many YouTube productivity gurus I binge-watched at 2AM, I still couldn’t get my life together.I forgot appointments, lost my wallet weekly, and had about 37 tabs open in my brain at all times. Spoiler: none of them were helpful.Turns out, I wasn’t lazy. I was just trying to organize my life using systems that were never made for a brain like mine.So I threw out the idea of being “organized” in the neurotypical sense and started building systems that actually worked for me — with my distractions, my hyperfocus, my tendency to drop socks mid-task and wander off like a cartoon character.Here are 10 simple hacks that helped me feel less chaotic — and maybe they’ll help you too.1. Use “dumb” checklists for “smart” daysOn good brain days, I used to forget basic stuff like brushing my teeth or feeding myself. So now I use a daily checklist that includes everything — even the obvious stuff.Brush teeth? ✔️Eat breakfast? ✔️Take meds? ✔️Put on pants? Sadly, yes. ✔️It sounds silly, but it keeps me grounded. And crossing things off feels amazing.Try this: Make your own “morning survival checklist.” Laminate it. Use a whiteboard marker. Laugh at it. Love it.2. One basket per chaos zoneI gave up trying to stop clutter. Instead, I contain it.Now every surface that used to collect junk has a designated basket. Keys, receipts, chargers, sunglasses — they all get thrown in.At the end of the week, I empty the baskets (or at least pretend I will).Try this: Walk around your home and spot the 3 most chaotic “dump zones.” Add a basket, tray, or box. That’s it.3. Timers = your best non-judgmental friendI don’t trust myself with time. 5 minutes becomes 2 hours. Or vice versa.So I use timers like a toddler learning to brush their teeth. Ten minutes for tidying. Twenty for emails. A five-minute warning before I have to stop hyperfocusing on Reddit.Try this: Set a 10-minute timer today and clean one room. Just one. Stop when it buzzes. No guilt.4. Visual reminders over written onesSticky notes? I forget to read them.But putting my meds next to the kettle? That works.We ADHD brains are object permanence-challenged. If we don’t see it, it doesn’t exist.Try this: Move your most forgotten task into your line of sight. Put it in your walking path. Tape it to your laptop if you have to.5. Pick your “launch pad”This one saved me from the daily panic of missing essentials.I now have a “launch pad” by the front door: keys, wallet, work bag, meds, umbrella. It’s all there, waiting like a faithful golden retriever.Try this: Create a launch pad. Use a basket, shelf, or even a shoebox. Put your everyday essentials there. Non-negotiable.6. Name your bins like a weirdoI used to shove things in random boxes. Out of sight, out of mind…until I needed them.Now, I give bins funny, obvious names. One says “Cables & Crap.” Another is “Stuff I Pretend I’ll Return.”It makes me smile — and more likely to use them.Try this: Label one bin in your house today. Make it ridiculous. ADHD brains love humor.7. Use “body doubling” even if you’re aloneI hate doing dishes. But if someone’s in the room with me — even if they’re just scrolling TikTok — I can do them.Body doubling (having someone nearby while you work) works. But when I’m solo, I fake it.I play a podcast or video of someone else doing the task. Boom — instant “fake coworker.”Try this: Next time you feel stuck, search “clean with me” or “study with me” on YouTube. Let your new internet buddy help.8. Keep a “maybe later” boxDecision paralysis is real. Do I throw this out? Will I need it next week? Will I regret it?Now, I chuck uncertain things into a “maybe later” box. Once a month, I revisit it.No more agonizing. Just delay the decision.Try this: Start your own “maybe” box. Label it “emotional clutter jail.”9. Gamify the boring stuffFiling paperwork feels like a punishment. But if I turn it into a 3-round game show, I’ll actually do it.Round 1: Stack papers. Round 2: Shred duplicates. Round 3: File the survivors.Add a reward — like tea or a nap. Brains like bribes.Try this: Turn one boring task today into a 3-step mini game. Bonus points for theme music.10. Don’t organize everything. Just what matters.Here’s the hard truth: you don’t have to be organized.You just need to make the most important things easier to access, use, and remember.You’re not a failure for having messy drawers or forgetting laundry. You’re a human with a differently-wired brain. Pick your priorities.Try this: What’s one thing that, if it ran smoother, would make your day easier? Start there.Final takeawaySo those are the 10 simple organization hacks that actually worked for my ADHD brain.Not all of them will work for you. And that’s okay.Take the ones that spark something. Ignore the rest. You don’t need a full system — just a few anchors to keep you steady.You’re not broken. You just need different tools.💬 Call to action (realistic + reassuring):Want more no-BS tips for living with ADHD, addiction recovery, and starting fresh at any age? I write weekly to help folks like us build lives we don’t need to escape from.Subscribe below — even if you only open one email a month, it might be the one that helps you get unstuck.",
  "harvested_at": "2026-01-28T22:49:09.133632"
}