{
  "url": "https://rhysmorgan.substack.com/p/10-simple-organization-hacks-that",
  "slug": "10-simple-organization-hacks-that",
  "title": "10 simple organization hacks that actually work for my ADHD brain",
  "subtitle": "",
  "author": "Unknown",
  "published": null,
  "content_html": "<div dir=\"auto\" class=\"body markup\"><p>I used to think I was just lazy.</p><p>No matter how many planners I bought or how many YouTube productivity gurus I binge-watched at 2AM, I still couldn’t get my life together.</p><p>I forgot appointments, lost my wallet weekly, and had about 37 tabs open in my brain at all times. Spoiler: none of them were helpful.</p><p>Turns out, I wasn’t lazy. I was just trying to organize my life using systems that were never made for a brain like mine.</p><p><span>So I threw out the idea of being “organized” in the neurotypical sense and started building systems that </span><em>actually worked</em><span> for me — with my distractions, my hyperfocus, my tendency to drop socks mid-task and wander off like a cartoon character.</span></p><p>Here are 10 simple hacks that helped me feel less chaotic — and maybe they’ll help you too.</p><div><hr/></div><h3 class=\"header-anchor-post\"><strong>1. Use “dumb” checklists for “smart” days</strong><div class=\"pencraft pc-display-flex pc-alignItems-center pc-position-absolute pc-reset header-anchor-parent\"><div class=\"pencraft pc-display-contents pc-reset pubTheme-yiXxQA\"><div id=\"§1-use-dumb-checklists-for-smart-days\" class=\"pencraft pc-reset header-anchor offset-top\"></div><button tabindex=\"0\" type=\"button\" aria-label=\"Link\" data-href=\"https://rhysmorgan.substack.com/i/162747903/1-use-dumb-checklists-for-smart-days\" class=\"pencraft pc-reset pencraft iconButton-mq_Et5 iconButtonBase-dJGHgN buttonBase-GK1x3M buttonStyle-r7yGCK size_sm-G3LciD priority_secondary-S63h9o\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"18\" height=\"18\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-link\"><path d=\"M10 13a5 5 0 0 0 7.54.54l3-3a5 5 0 0 0-7.07-7.07l-1.72 1.71\"></path><path d=\"M14 11a5 5 0 0 0-7.54-.54l-3 3a5 5 0 0 0 7.07 7.07l1.71-1.71\"></path></svg></button></div></div></h3><p><span>On good brain days, I used to forget basic stuff like brushing my teeth or feeding myself. So now I use a </span><em>daily checklist</em><span> that includes everything — even the obvious stuff.</span></p><ul><li><p><span>Brush teeth? ✔️</span><br/><br/></p></li><li><p><span>Eat breakfast? ✔️</span><br/><br/></p></li><li><p><span>Take meds? ✔️</span><br/><br/></p></li><li><p><span>Put on pants? Sadly, yes. ✔️</span><br/><br/></p></li></ul><p><span>It sounds silly, but it keeps me grounded. And crossing things off feels </span><em>amazing</em><span>.</span></p><p><strong>Try this:</strong><span> Make your own “morning survival checklist.” Laminate it. Use a whiteboard marker. Laugh at it. Love it.</span></p><div><hr/></div><h3 class=\"header-anchor-post\"><strong>2. One basket per chaos zone</strong><div class=\"pencraft pc-display-flex pc-alignItems-center pc-position-absolute pc-reset header-anchor-parent\"><div class=\"pencraft pc-display-contents pc-reset pubTheme-yiXxQA\"><div id=\"§2-one-basket-per-chaos-zone\" class=\"pencraft pc-reset header-anchor offset-top\"></div><button tabindex=\"0\" type=\"button\" aria-label=\"Link\" data-href=\"https://rhysmorgan.substack.com/i/162747903/2-one-basket-per-chaos-zone\" class=\"pencraft pc-reset pencraft iconButton-mq_Et5 iconButtonBase-dJGHgN buttonBase-GK1x3M buttonStyle-r7yGCK size_sm-G3LciD priority_secondary-S63h9o\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"18\" height=\"18\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-link\"><path d=\"M10 13a5 5 0 0 0 7.54.54l3-3a5 5 0 0 0-7.07-7.07l-1.72 1.71\"></path><path d=\"M14 11a5 5 0 0 0-7.54-.54l-3 3a5 5 0 0 0 7.07 7.07l1.71-1.71\"></path></svg></button></div></div></h3><p>I gave up trying to stop clutter. Instead, I contain it.</p><p>Now every surface that used to collect junk has a designated basket. Keys, receipts, chargers, sunglasses — they all get thrown in.</p><p>At the end of the week, I empty the baskets (or at least pretend I will).</p><p><strong>Try this:</strong><span> Walk around your home and spot the 3 most chaotic “dump zones.” Add a basket, tray, or box. That’s it.</span></p><div><hr/></div><h3 class=\"header-anchor-post\"><strong>3. Timers = your best non-judgmental friend</strong><div class=\"pencraft pc-display-flex pc-alignItems-center pc-position-absolute pc-reset header-anchor-parent\"><div class=\"pencraft pc-display-contents pc-reset pubTheme-yiXxQA\"><div id=\"§3-timers-your-best-non-judgmental-friend\" class=\"pencraft pc-reset header-anchor offset-top\"></div><button tabindex=\"0\" type=\"button\" aria-label=\"Link\" data-href=\"https://rhysmorgan.substack.com/i/162747903/3-timers-your-best-non-judgmental-friend\" class=\"pencraft pc-reset pencraft iconButton-mq_Et5 iconButtonBase-dJGHgN buttonBase-GK1x3M buttonStyle-r7yGCK size_sm-G3LciD priority_secondary-S63h9o\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"18\" height=\"18\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-lineca",
  "content_text": "I used to think I was just lazy. No matter how many planners I bought or how many YouTube productivity gurus I binge-watched at 2AM, I still couldn’t get my life together. I forgot appointments, lost my wallet weekly, and had about 37 tabs open in my brain at all times. Spoiler: none of them were helpful. Turns out, I wasn’t lazy. I was just trying to organize my life using systems that were never made for a brain like mine. So I threw out the idea of being “organized” in the neurotypical sense and started building systems that actually worked for me — with my distractions, my hyperfocus, my tendency to drop socks mid-task and wander off like a cartoon character. Here are 10 simple hacks that helped me feel less chaotic — and maybe they’ll help you too. 1. Use “dumb” checklists for “smart” days On good brain days, I used to forget basic stuff like brushing my teeth or feeding myself. So now I use a daily checklist that includes everything — even the obvious stuff. Brush teeth? ✔️ Eat breakfast? ✔️ Take meds? ✔️ Put on pants? Sadly, yes. ✔️ It sounds silly, but it keeps me grounded. And crossing things off feels amazing . Try this: Make your own “morning survival checklist.” Laminate it. Use a whiteboard marker. Laugh at it. Love it. 2. One basket per chaos zone I gave up trying to stop clutter. Instead, I contain it. Now every surface that used to collect junk has a designated basket. Keys, receipts, chargers, sunglasses — they all get thrown in. At the end of the week, I empty the baskets (or at least pretend I will). Try this: Walk around your home and spot the 3 most chaotic “dump zones.” Add a basket, tray, or box. That’s it. 3. Timers = your best non-judgmental friend I don’t trust myself with time. 5 minutes becomes 2 hours. Or vice versa. So I use timers like a toddler learning to brush their teeth. Ten minutes for tidying. Twenty for emails. A five-minute warning before I have to stop hyperfocusing on Reddit. Try this: Set a 10-minute timer today and clean one room. Just one. Stop when it buzzes. No guilt. 4. Visual reminders over written ones Sticky notes? I forget to read them. But putting my meds next to the kettle? That works. We ADHD brains are object permanence-challenged. If we don’t see it, it doesn’t exist. Try this: Move your most forgotten task into your line of sight. Put it in your walking path. Tape it to your laptop if you have to. 5. Pick your “launch pad” This one saved me from the daily panic of missing essentials. I now have a “launch pad” by the front door: keys, wallet, work bag, meds, umbrella. It’s all there, waiting like a faithful golden retriever. Try this: Create a launch pad. Use a basket, shelf, or even a shoebox. Put your everyday essentials there. Non-negotiable. 6. Name your bins like a weirdo I used to shove things in random boxes. Out of sight, out of mind…until I needed them. Now, I give bins funny, obvious names. One says “Cables &amp; Crap.” Another is “Stuff I Pretend I’ll Return.” It makes me smile —",
  "harvested_at": "2026-01-28T22:14:39.326738"
}