{
  "url": "https://rhysmorgan.substack.com/p/adhd-autism-and-household-chores",
  "slug": "adhd-autism-and-household-chores-7-brutal-strategies-to-survive-the-domestic-apo",
  "title": "adhd, autism, and household chores: 7 brutal strategies to survive the domestic apocalypse and how Greggs is a godsend.",
  "subtitle": "simple, sardonic, and slightly insane systems for neurodivergent adults who just want a clean damn kitchen (but also want to cry in the pantry)",
  "author": "Rhys Morgan",
  "published": "Sun, 30 Mar 2025 11:30:52 GMT",
  "content_html": "<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/$s_!CqUl!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!CqUl!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!CqUl!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!CqUl!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!CqUl!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/$s_!CqUl!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png\" width=\"1024\" height=\"608\" data-attrs=\"{&quot;src&quot;:&quot;https://substack-post-media.s3.amazonaws.com/public/images/d28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png&quot;,&quot;srcNoWatermark&quot;:null,&quot;fullscreen&quot;:null,&quot;imageSize&quot;:&quot;normal&quot;,&quot;height&quot;:608,&quot;width&quot;:1024,&quot;resizeWidth&quot;:null,&quot;bytes&quot;:null,&quot;alt&quot;:null,&quot;title&quot;:null,&quot;type&quot;:null,&quot;href&quot;:null,&quot;belowTheFold&quot;:false,&quot;topImage&quot;:true,&quot;internalRedirect&quot;:null,&quot;isProcessing&quot;:false,&quot;align&quot;:null,&quot;offset&quot;:false}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!CqUl!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!CqUl!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!CqUl!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!CqUl!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd28f5cb4-dc71-475c-b9ef-a0fdc7319d61_1024x608.png 1456w\" sizes=\"100vw\" fetchpriority=\"high\"></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\"><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" style=\"height:20px;width:20px\" width=\"20\" height=\"20\" viewBox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title><path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button></div></div></div></a><figcaption class=\"image-caption\">messy laundry</figcaption></figure></div><p><strong>Excerpt:<br> This isn&#8217;t another perky Pinterest list of &#8220;fun ways to fold towels.&#8221; This is for the executive dysfunction warriors who&#8217;ve rage quit laundry four times this week and are currently eating cereal out of a measuring cup.</strong></p><p><strong>Let me set the scene.</strong></p><p><strong>It&#8217;s 2:13pm. I&#8217;m staring into the abyss of my laundry basket like it just insulted my ancestors. The sink is full. The floor is crunchy. There&#8217;s a weird smell that might be cheese&#8230; or trauma.</strong></p><p><strong>And I&#8217;ve just spent the last hour googling &#8220;how to clean when you have adhd and want to die.&#8221;</strong></p><p><strong>Relatable? Cool. You&#8217;re in the right place.</strong></p><p><strong>Because this isn&#8217;t a cute article about &#8220;making chores fun!&#8221; (Fuck that noise.)</strong></p><p><strong>This is about survival. It&#8217;s about cleaning your home without burning it down or weeping into the mop bucket. It's about navigating chores as a neurodivergent adult when your brain has declared civil war every time someone says &#8220;just tidy up real quick.&#8221;</strong></p><div><hr></div><h3><strong>1. embrace the chaos (but also name it)</strong></h3><p><strong>Let&#8217;s get this straight: your brain isn't lazy. It's just running a high-speed, low-control fireworks display of dopamine and dread.</strong></p><p><strong>So instead of pretending we&#8217;re neurotypical housewives from the 1950s (hi Carol), accept the reality: </strong><em><strong>you need a system built for the chaos.</strong></em></p><p><strong>Naming the enemy helps. My executive dysfunction? I call her Rhiannnon (I know, sorry, Fleetwood Mac, it hurts me too, but my old Welsh Grammar teacher was in the wrong job. She hated children; wtf was she doing as a deputy head in my school? Miss Rhiannon Roberts is a spiteful gremlin who hates dishwashers and loves avoidance. When I say &#8220;fuck off, Rhiannon &#8221; I feel mildly better. That counts as progress.</strong></p><div><hr></div><h3><strong>2. clean in rage bursts</strong></h3><p><strong>Look, your attention span is on a timer shorter than a TikTok. Don&#8217;t fight it&#8212;weaponize it.</strong></p><p><strong>Set a 5-minute timer. Clean like you&#8217;re running from the cops. Then stop.</strong></p><p><strong>That&#8217;s it. Rage cleaning is valid. Rage cleaning is holy. Rage cleaning gets you a semi-tidy living room and a sense of superiority over your own procrastination.</strong></p><p><strong>Bonus tip: blast angry music while you do it.Some like early 2000s emo. I like hard house music at an insane bpm - Really brings out the cleaning trauma vibes.</strong></p><div><hr></div><h3><strong>3. use the \"object permanence pantry\" system</strong></h3><p>If it&#8217;s out of sight, it&#8217;s dead to me.</p><p>That includes groceries, mail, laundry, the cat. (if I had a cat)</p><p>Solution? Everything visible, everything labeled, nothing behind doors. If you have to open a cabinet to remember what you own, you will not remember. You will rebuy cumin five times. Your fridge will become a graveyard of forgotten spinach.</p><p>I use clear bins with giant black letters like I&#8217;m running a preschool for semi-feral adults. It works. I haven&#8217;t lost my keys in 6 days. That&#8217;s a world record.</p><div><hr></div><h3><strong>4. avoid multi-step chore traps</strong></h3><p>This one&#8217;s a classic ADHD fuck-you: &#8220;I&#8217;ll just do a quick load of laundry.&#8221;</p><p>Thirty-seven steps later I&#8217;m knee-deep in a closet purge, crying about a shirt I wore once in 2016.</p><p>Don&#8217;t do that. Break tasks into <em>painfully small</em> chunks. Then break them smaller. Then break them again.</p><p>&#8220;Laundry&#8221; becomes:</p><ul><li><p>gather dirty clothes<br><br></p></li><li><p>dump in machine<br><br></p></li><li><p>press buttons<br><br></p></li><li><p>walk away like a champion<br><br></p></li></ul><p>If your task has the word &#8220;just&#8221; in it, it&#8217;s probably a trap.</p><div><hr></div><h3><strong>5. chore charts are not for kids. they&#8217;re for unhinged adults with memory holes</strong></h3><p>I used to scoff at chore charts. Then I forgot to take the trash out for 3 weeks and birthed a fruit fly colony that could unionize.</p><p>Now? I live by my chore board. It&#8217;s color-coded, laminated, and slightly terrifying.</p><p>Why it works: visual reminders bypass the mental fog. You don&#8217;t have to <em>remember</em> what to do. The chart remembers for you. It&#8217;s the outsourced brain cell you deserve.</p><p>And no, you&#8217;re not &#8220;too old&#8221; for a sticker reward system. Give yourself a damn gold star. You earned it.</p><div><hr></div><h3><strong>6. bribe yourself shamelessly</strong></h3><p>Want me to vacuum? Cool. Pay me in Greggs Sausage rolls alternated with the custard cream donuts  or the chicken bites with sweet chilli sauce ok if you&#8217;re American, something else. You need Greggs trust me anyway I digress.</p><p>Motivation doesn&#8217;t magically appear. Neurodivergent motivation is a gremlin that responds to bribes, threats, and the promise of dopamine or Greggs which is the same trust me.</p><p>So, create a reward loop:</p><ul><li><p>clean bathroom = 15 minutes of guilt-free scrolling oh ok I&#8217;d take the rest of the day off.<br></p></li><li><p>do the dishes = one cookie<br></p></li><li><p>tidy the entryway = TikTok binge<br></p></li></ul><p>Yes, you&#8217;re gamifying your life like a 9-year-old. Yes, it works. No, I don&#8217;t care if it&#8217;s &#8220;childish.&#8221; I&#8217;m a grown-ass adult and I&#8217;ll clean for snacks like a well-trained Pavlovian conditioned ant.</p><div><hr></div><h3><strong>7. stop aiming for \"clean\"&#8212;aim for \"less disgusting\"</strong></h3><p>This one&#8217;s important.</p><p>Perfection is a lie sold to us by neurotypical influencers with clean white couches and no pets. Mrs Hinch and Ms Kondo? nope me neither If you&#8217;re autistic, ADHD, or both (hi again), your energy is limited. Your focus is unpredictable. Your tolerance for bullshit is very low.</p><p>So stop aiming for spotless.</p><p>Instead, ask: &#8220;what would make this room 10% less disgusting?&#8221;</p><p>If the answer is &#8220;removing the old coffee cup graveyard,&#8221; do that. Then stop.</p><p>&#8220;Good enough&#8221; is revolutionary. You don&#8217;t need sparkle. You need <em>function</em>. And maybe a clear path to the bed.</p><div><hr></div><p><strong>The twist:</strong></p><p>I used to think I was just broken. That I was failing at basic adulthood because I couldn&#8217;t keep up with what everyone else made look so easy.</p><p>Turns out... I&#8217;m not broken.</p><p>I just needed to stop playing by neurotypical rules.</p><p>Your brain is not your enemy. Your house doesn&#8217;t have to be a war zone. You&#8217;re allowed to do chores in weird, non-linear, deeply chaotic ways that make absolutely no sense to anyone else but <em>work for you</em>.</p><p>And if that means vacuuming in a bathrobe at midnight while narrating your actions like a nature documentary&#8212;so be it.</p><p>That&#8217;s not weird.</p><p>That&#8217;s adaptive brilliance.</p><p>Welcome to the revolution.</p><p><strong>Final takeaway<br></strong> Don&#8217;t aim for perfection. Aim for <em>done</em>. Celebrate the messy wins. Weaponize your weirdness.</p><p>And remember: you&#8217;re not failing at chores. You&#8217;re surviving a battle your brain didn&#8217;t sign up for.</p><p><br> If this hits home, share it with someone else who&#8217;s drowning in dishes and executive dysfunction. Or better yet, make a rage cleaning playlist and start with one drawer&#8212;just one. Then message me and tell me what you found in there. (Spoiler: it&#8217;s batteries. It&#8217;s always batteries.)</p>",
  "content_text": "messy laundryExcerpt: This isn’t another perky Pinterest list of “fun ways to fold towels.” This is for the executive dysfunction warriors who’ve rage quit laundry four times this week and are currently eating cereal out of a measuring cup.Let me set the scene.It’s 2:13pm. I’m staring into the abyss of my laundry basket like it just insulted my ancestors. The sink is full. The floor is crunchy. There’s a weird smell that might be cheese… or trauma.And I’ve just spent the last hour googling “how to clean when you have adhd and want to die.”Relatable? Cool. You’re in the right place.Because this isn’t a cute article about “making chores fun!” (Fuck that noise.)This is about survival. It’s about cleaning your home without burning it down or weeping into the mop bucket. It's about navigating chores as a neurodivergent adult when your brain has declared civil war every time someone says “just tidy up real quick.”1. embrace the chaos (but also name it)Let’s get this straight: your brain isn't lazy. It's just running a high-speed, low-control fireworks display of dopamine and dread.So instead of pretending we’re neurotypical housewives from the 1950s (hi Carol), accept the reality: you need a system built for the chaos.Naming the enemy helps. My executive dysfunction? I call her Rhiannnon (I know, sorry, Fleetwood Mac, it hurts me too, but my old Welsh Grammar teacher was in the wrong job. She hated children; wtf was she doing as a deputy head in my school? Miss Rhiannon Roberts is a spiteful gremlin who hates dishwashers and loves avoidance. When I say “fuck off, Rhiannon ” I feel mildly better. That counts as progress.2. clean in rage burstsLook, your attention span is on a timer shorter than a TikTok. Don’t fight it—weaponize it.Set a 5-minute timer. Clean like you’re running from the cops. Then stop.That’s it. Rage cleaning is valid. Rage cleaning is holy. Rage cleaning gets you a semi-tidy living room and a sense of superiority over your own procrastination.Bonus tip: blast angry music while you do it.Some like early 2000s emo. I like hard house music at an insane bpm - Really brings out the cleaning trauma vibes.3. use the \"object permanence pantry\" systemIf it’s out of sight, it’s dead to me.That includes groceries, mail, laundry, the cat. (if I had a cat)Solution? Everything visible, everything labeled, nothing behind doors. If you have to open a cabinet to remember what you own, you will not remember. You will rebuy cumin five times. Your fridge will become a graveyard of forgotten spinach.I use clear bins with giant black letters like I’m running a preschool for semi-feral adults. It works. I haven’t lost my keys in 6 days. That’s a world record.4. avoid multi-step chore trapsThis one’s a classic ADHD fuck-you: “I’ll just do a quick load of laundry.”Thirty-seven steps later I’m knee-deep in a closet purge, crying about a shirt I wore once in 2016.Don’t do that. Break tasks into painfully small chunks. Then break them smaller. Then break them again.“Laundry” becomes:gather dirty clothesdump in machinepress buttonswalk away like a championIf your task has the word “just” in it, it’s probably a trap.5. chore charts are not for kids. they’re for unhinged adults with memory holesI used to scoff at chore charts. Then I forgot to take the trash out for 3 weeks and birthed a fruit fly colony that could unionize.Now? I live by my chore board. It’s color-coded, laminated, and slightly terrifying.Why it works: visual reminders bypass the mental fog. You don’t have to remember what to do. The chart remembers for you. It’s the outsourced brain cell you deserve.And no, you’re not “too old” for a sticker reward system. Give yourself a damn gold star. You earned it.6. bribe yourself shamelesslyWant me to vacuum? Cool. Pay me in Greggs Sausage rolls alternated with the custard cream donuts  or the chicken bites with sweet chilli sauce ok if you’re American, something else. You need Greggs trust me anyway I digress.Motivation doesn’t magically appear. Neurodivergent motivation is a gremlin that responds to bribes, threats, and the promise of dopamine or Greggs which is the same trust me.So, create a reward loop:clean bathroom = 15 minutes of guilt-free scrolling oh ok I’d take the rest of the day off.do the dishes = one cookietidy the entryway = TikTok bingeYes, you’re gamifying your life like a 9-year-old. Yes, it works. No, I don’t care if it’s “childish.” I’m a grown-ass adult and I’ll clean for snacks like a well-trained Pavlovian conditioned ant.7. stop aiming for \"clean\"—aim for \"less disgusting\"This one’s important.Perfection is a lie sold to us by neurotypical influencers with clean white couches and no pets. Mrs Hinch and Ms Kondo? nope me neither If you’re autistic, ADHD, or both (hi again), your energy is limited. Your focus is unpredictable. Your tolerance for bullshit is very low.So stop aiming for spotless.Instead, ask: “what would make this room 10% less disgusting?”If the answer is “removing the old coffee cup graveyard,” do that. Then stop.“Good enough” is revolutionary. You don’t need sparkle. You need function. And maybe a clear path to the bed.The twist:I used to think I was just broken. That I was failing at basic adulthood because I couldn’t keep up with what everyone else made look so easy.Turns out... I’m not broken.I just needed to stop playing by neurotypical rules.Your brain is not your enemy. Your house doesn’t have to be a war zone. You’re allowed to do chores in weird, non-linear, deeply chaotic ways that make absolutely no sense to anyone else but work for you.And if that means vacuuming in a bathrobe at midnight while narrating your actions like a nature documentary—so be it.That’s not weird.That’s adaptive brilliance.Welcome to the revolution.Final takeaway Don’t aim for perfection. Aim for done. Celebrate the messy wins. Weaponize your weirdness.And remember: you’re not failing at chores. You’re surviving a battle your brain didn’t sign up for. If this hits home, share it with someone else who’s drowning in dishes and executive dysfunction. Or better yet, make a rage cleaning playlist and start with one drawer—just one. Then message me and tell me what you found in there. (Spoiler: it’s batteries. It’s always batteries.)",
  "harvested_at": "2026-01-28T22:49:09.134946"
}