{
  "url": "https://rhysmorgan.substack.com/p/the-moment-it-clicked-my-late-diagnosis",
  "slug": "the-moment-it-clicked-my-late-diagnosis-story",
  "title": "The Moment It Clicked: My Late Diagnosis Story",
  "subtitle": "I was 54 when the penny finally dropped: I wasn’t broken. I was autistic.",
  "author": "Rhys Morgan",
  "published": "Sun, 03 Aug 2025 13:32:53 GMT",
  "content_html": "<p><em>As a kid, I knew something was &#8220;off,&#8221; though I couldn&#8217;t put words to it. Lunchtimes were the worst &#8212; the clatter of plates and trays in a packed school dinner hall felt like standing next to a jet engine. I&#8217;d escape whenever I could. Evening meals at home , I had two brothers. I hated the competition , the noise arhghghgh</em></p><p><em>While my classmates swapped gossip, I escaped to have a lunchtime meal - a mars bar and mints (dieticians don&#8217;t judge me) at home I escaped into jigsaws, solitaire I escaped and music. Every Sunday, I&#8217;d sit by the radio recording the Top 40, (Uk readers of a certain age will have done a version of this I would be ready to rewind and replay the songs that hit me hardest. The Undertones, Earth, Wind &amp; Fire&#8217;s Let&#8217;s Groove &#8212; I&#8217;d listen on repeat until the tape wore thin. Meanwhile, in lessons, I was miles away, lost in daydreams because there was zero dopamine in Ovid&#8217;s love poems or Cicero&#8217;s letters. The causes and consequences of the Industrial Revolution - who cared? The spinning jenny and steam but no dopamine.</em></p><p><em>That pattern followed me into university. Making new friends was painfully hard. I was homesick, drained by 10 p.m., and often left parties early &#8212; long before the fun really began.</em></p><div><hr></div><h3><em><strong>Masking my way through adulthood</strong></em></h3><p><em>Adulthood didn&#8217;t make things easier &#8212; it just meant the stakes were higher. At work, I constantly misread social signs and was hopeless at office politics. The same thing happened when I became an Anglican priest. I loved parts of the role, but apart from Sunday I lacked a daily structure and was often blind to unspoken rules just like previous jobs, that others seemed to navigate effortlessly.</em></p><p><em>Alcohol became my shortcut to confidence. It dulled the exhaustion and smoothed over the gaps in my social game. But the cost was high. Eventually, my marriage fell apart. And so did I.</em></p><div><hr></div><h3><em><strong>The unexpected connection at an AA meeting</strong></em></h3><p><em>Then, one day in an AA meeting, everything shifted. A woman began to share her story. In detail, her life looked nothing like mine. But as she described her struggles at work and the way she&#8217;d always felt different, it was like listening to my own thoughts being spoken aloud.</em></p><p><em>In that moment, the penny dropped. A personal epiphany.<br> That&#8217;s my story exactly &#8212; apart from getting pregnant, of course.</em></p><p><em>I sat there thinking: Oh my God. This is it. This is me.</em></p><div><hr></div><h3><em><strong>My wife&#8217;s push and the official diagnosis</strong></em></h3><p><em>Even then, I didn&#8217;t rush to act. It was my wife who gently pushed me: &#8220;Maybe you should get tested.&#8221; At 54 years old, I finally did.</em></p><p><em>When the diagnosis came back &#8212; autistic, with ADHD &#8212; I felt a rush of emotions collide: relief that I finally had an explanation, sadness for the years I&#8217;d spent stumbling in the dark, and a quiet strength knowing I wasn&#8217;t imagining it.</em></p><p><em>If I&#8217;m honest, I knew before the results came in. The moment I suspected, I went into hyperfocus mode, researching everything I could get my hands on.</em></p><div><hr></div><h3><em><strong>The &#8220;aha&#8221; moment: self-doubt turning into self-acceptance</strong></em></h3><p><em>That was the moment it clicked.<br> The exhaustion after school.<br> The boredom in lessons.<br> The misread social signs.<br> The confidence borrowed from alcohol.</em></p><p><em>I wasn&#8217;t broken. I wasn&#8217;t failing at being &#8220;normal.&#8221;<br> I was neurodivergent.</em></p><p><em>It didn&#8217;t erase the struggles. But it gave me a framework &#8212; a map where before there&#8217;d only been fog. And slowly, step by step, I began the messy but freeing work of self-acceptance.</em></p><div><hr></div><h3><em><strong>Final takeaway</strong></em></h3><p><em>If you&#8217;ve ever felt like life was heavier to carry without knowing why, I see you. A late diagnosis doesn&#8217;t change the past, but it can transform how you see yourself in the present. For me, it turned years of self-doubt into a new kind of understanding &#8212; one that made compassion possible.</em></p><h3><em><strong>Your turn</strong></em></h3><p><em>I&#8217;d love to hear your story. If you&#8217;ve had your own &#8220;aha&#8221; moment &#8212; whether through a formal diagnosis or a slow realisation &#8212; share it in the comments or email me directly. I&#8217;m planning a future community roundup, and your story could help someone else finally see themselves more clearly.</em></p><p>What was <em>your</em> &#8220;aha&#8221; moment &#8212; the time life finally made sense?</p>",
  "content_text": "As a kid, I knew something was “off,” though I couldn’t put words to it. Lunchtimes were the worst — the clatter of plates and trays in a packed school dinner hall felt like standing next to a jet engine. I’d escape whenever I could. Evening meals at home , I had two brothers. I hated the competition , the noise arhghghghWhile my classmates swapped gossip, I escaped to have a lunchtime meal - a mars bar and mints (dieticians don’t judge me) at home I escaped into jigsaws, solitaire I escaped and music. Every Sunday, I’d sit by the radio recording the Top 40, (Uk readers of a certain age will have done a version of this I would be ready to rewind and replay the songs that hit me hardest. The Undertones, Earth, Wind & Fire’s Let’s Groove — I’d listen on repeat until the tape wore thin. Meanwhile, in lessons, I was miles away, lost in daydreams because there was zero dopamine in Ovid’s love poems or Cicero’s letters. The causes and consequences of the Industrial Revolution - who cared? The spinning jenny and steam but no dopamine.That pattern followed me into university. Making new friends was painfully hard. I was homesick, drained by 10 p.m., and often left parties early — long before the fun really began.Masking my way through adulthoodAdulthood didn’t make things easier — it just meant the stakes were higher. At work, I constantly misread social signs and was hopeless at office politics. The same thing happened when I became an Anglican priest. I loved parts of the role, but apart from Sunday I lacked a daily structure and was often blind to unspoken rules just like previous jobs, that others seemed to navigate effortlessly.Alcohol became my shortcut to confidence. It dulled the exhaustion and smoothed over the gaps in my social game. But the cost was high. Eventually, my marriage fell apart. And so did I.The unexpected connection at an AA meetingThen, one day in an AA meeting, everything shifted. A woman began to share her story. In detail, her life looked nothing like mine. But as she described her struggles at work and the way she’d always felt different, it was like listening to my own thoughts being spoken aloud.In that moment, the penny dropped. A personal epiphany. That’s my story exactly — apart from getting pregnant, of course.I sat there thinking: Oh my God. This is it. This is me.My wife’s push and the official diagnosisEven then, I didn’t rush to act. It was my wife who gently pushed me: “Maybe you should get tested.” At 54 years old, I finally did.When the diagnosis came back — autistic, with ADHD — I felt a rush of emotions collide: relief that I finally had an explanation, sadness for the years I’d spent stumbling in the dark, and a quiet strength knowing I wasn’t imagining it.If I’m honest, I knew before the results came in. The moment I suspected, I went into hyperfocus mode, researching everything I could get my hands on.The “aha” moment: self-doubt turning into self-acceptanceThat was the moment it clicked. The exhaustion after school. The boredom in lessons. The misread social signs. The confidence borrowed from alcohol.I wasn’t broken. I wasn’t failing at being “normal.” I was neurodivergent.It didn’t erase the struggles. But it gave me a framework — a map where before there’d only been fog. And slowly, step by step, I began the messy but freeing work of self-acceptance.Final takeawayIf you’ve ever felt like life was heavier to carry without knowing why, I see you. A late diagnosis doesn’t change the past, but it can transform how you see yourself in the present. For me, it turned years of self-doubt into a new kind of understanding — one that made compassion possible.Your turnI’d love to hear your story. If you’ve had your own “aha” moment — whether through a formal diagnosis or a slow realisation — share it in the comments or email me directly. I’m planning a future community roundup, and your story could help someone else finally see themselves more clearly.What was your “aha” moment — the time life finally made sense?",
  "harvested_at": "2026-01-28T22:49:09.133353"
}