{
  "url": "https://rhysmorgan.substack.com/p/the-odd-power-of-transition-rituals",
  "slug": "the-odd-power-of-transition-rituals-or-how-i-tricked-my-brain-into-doing-stuff",
  "title": "The odd power of “transition rituals” (or how I tricked my brain into doing stuff)",
  "subtitle": "A surprisingly effective hack for neurodivergent brains stuck between tasks, dread, and the void",
  "author": "Rhys Morgan",
  "published": "Thu, 03 Apr 2025 06:39:56 GMT",
  "content_html": "<p>If you&#8217;ve ever sat on your bed for 37 minutes staring at a wall because you &#8220;should&#8221; be doing something else&#8230;</p><p>Yeah. Same.</p><p>Here&#8217;s the thing.</p><p>Changing tasks is weirdly hard.</p><p>It&#8217;s not even about the <em>task</em> half the time.<br> It&#8217;s the switch.</p><p>Like, I could have just crushed a 2-hour hyperfocus deep dive on some obscure Wikipedia rabbit hole&#8230;</p><p>And now I&#8217;m supposed to&#8230; what?<br> Fold laundry?<br> Respond to that email from &#8220;Tammy &#8211; HR&#8221;?<br> Go outside where <em>people</em> are?</p><p>My brain&#8217;s like, &#8220;Nah. We live here now. In this weird between-space. Forever.&#8221;</p><p>Used to think I was just lazy.</p><p>Like, &#8220;Why can&#8217;t you just do the thing?&#8221;<br> Cue the self-loathing soundtrack.</p><p>But turns out... it&#8217;s a thing.<br> <strong>Task switching</strong> is hard for neurodivergent brains. Like, <em>scientifically</em>. Executive function? Never heard of her.</p><p>So I tried something I once laughed at:<br> <strong>Transition rituals.</strong></p><p>Yeah, it sounds like something a YouTube wellness influencer yells about while selling mushroom tea...<br> But it works.</p><p>Here&#8217;s what I mean.</p><p>A transition ritual is just a tiny, repeatable action that tells your brain:</p><blockquote><p>&#8220;This thing is over. We&#8217;re starting a new thing now. No, you don&#8217;t get a vote.&#8221;</p></blockquote><p>You&#8217;re not trying to summon the productivity gods. You&#8217;re just giving your brain a little closure ceremony.</p><p>Like a funeral... but for your spreadsheet.</p><p>Here&#8217;s some of mine:</p><ul><li><p>I clap. Literally. Like a weird seal. One loud clap.<br><br></p></li><li><p>I play one stupid upbeat song clip &#8212; like a 6-second blast of something obnoxious<br><br></p></li><li><p>I chug a glass of water like I&#8217;m in a hydration competition<br><br></p></li><li><p>I write one line in my notebook that says, &#8220;Done with [thing]. Now: [new thing]&#8221;<br><br></p></li><li><p>I do a dramatic arms-wide stretch like I&#8217;m an office worker in a sitcom<br><br></p></li><li><p>I turn my chair 90 degrees. Just a symbolic &#8220;new direction&#8221; thing. Works weirdly well.<br><br></p></li></ul><p>None of this is glamorous. Or deep.</p><p>But it tells my brain: <em>that task is over... let&#8217;s move on.</em></p><p>Without that ritual?<br> I&#8217;d just sit there stewing in vague dread, maybe open and close the same three tabs 14 times, pretend to write a to-do list, question my life choices, then spiral into Reddit.</p><p>Important part:<br> You have to <strong>repeat</strong> the same ritual. That&#8217;s how your brain learns it.</p><p>It&#8217;s like Pavlov's dog... but sadder. And with less drool. Hopefully.</p><p>It won&#8217;t work instantly. But it helps.<br> Especially when you&#8217;ve got the ADHD freeze, the autistic hyperfocus dismount, or just that lovely executive function meltdown that says &#8220;you can&#8217;t go forward and you can&#8217;t go back.&#8221;</p><p>It&#8217;s a rope ladder out of the in-between.</p><p>So if you find yourself stuck halfway between &#8220;done&#8221; and &#8220;not-started,&#8221;<br> give transition rituals a shot.</p><p>Make it dumb. Make it easy. Make it yours.</p><p>Doesn&#8217;t matter what it is. Just that you do it. Every time.</p><p>Because if your brain won&#8217;t shift gears on its own&#8230;<br> sometimes you gotta trick it.</p><p><strong>Final takeaway:<br></strong> If you're tired of living in task-switching purgatory, try a transition ritual. One dumb little move might be the rope ladder your brain's been waiting for.</p><p>Need help picking your ritual? Or wanna see how this could look in social format? Hit me up &#8212; I&#8217;ve got a whole list of tiny actions that trick my brain daily.</p>",
  "content_text": "If you’ve ever sat on your bed for 37 minutes staring at a wall because you “should” be doing something else…Yeah. Same.Here’s the thing.Changing tasks is weirdly hard.It’s not even about the task half the time. It’s the switch.Like, I could have just crushed a 2-hour hyperfocus deep dive on some obscure Wikipedia rabbit hole…And now I’m supposed to… what? Fold laundry? Respond to that email from “Tammy – HR”? Go outside where people are?My brain’s like, “Nah. We live here now. In this weird between-space. Forever.”Used to think I was just lazy.Like, “Why can’t you just do the thing?” Cue the self-loathing soundtrack.But turns out... it’s a thing. Task switching is hard for neurodivergent brains. Like, scientifically. Executive function? Never heard of her.So I tried something I once laughed at: Transition rituals.Yeah, it sounds like something a YouTube wellness influencer yells about while selling mushroom tea... But it works.Here’s what I mean.A transition ritual is just a tiny, repeatable action that tells your brain:“This thing is over. We’re starting a new thing now. No, you don’t get a vote.”You’re not trying to summon the productivity gods. You’re just giving your brain a little closure ceremony.Like a funeral... but for your spreadsheet.Here’s some of mine:I clap. Literally. Like a weird seal. One loud clap.I play one stupid upbeat song clip — like a 6-second blast of something obnoxiousI chug a glass of water like I’m in a hydration competitionI write one line in my notebook that says, “Done with [thing]. Now: [new thing]”I do a dramatic arms-wide stretch like I’m an office worker in a sitcomI turn my chair 90 degrees. Just a symbolic “new direction” thing. Works weirdly well.None of this is glamorous. Or deep.But it tells my brain: that task is over... let’s move on.Without that ritual? I’d just sit there stewing in vague dread, maybe open and close the same three tabs 14 times, pretend to write a to-do list, question my life choices, then spiral into Reddit.Important part: You have to repeat the same ritual. That’s how your brain learns it.It’s like Pavlov's dog... but sadder. And with less drool. Hopefully.It won’t work instantly. But it helps. Especially when you’ve got the ADHD freeze, the autistic hyperfocus dismount, or just that lovely executive function meltdown that says “you can’t go forward and you can’t go back.”It’s a rope ladder out of the in-between.So if you find yourself stuck halfway between “done” and “not-started,” give transition rituals a shot.Make it dumb. Make it easy. Make it yours.Doesn’t matter what it is. Just that you do it. Every time.Because if your brain won’t shift gears on its own… sometimes you gotta trick it.Final takeaway: If you're tired of living in task-switching purgatory, try a transition ritual. One dumb little move might be the rope ladder your brain's been waiting for.Need help picking your ritual? Or wanna see how this could look in social format? Hit me up — I’ve got a whole list of tiny actions that trick my brain daily.",
  "harvested_at": "2026-01-28T22:49:09.134696"
}